[
{"key": "liu-bei", "partners": ["Guan Yu 关羽 (Sworn Brother)", "Zhang Fei 张飞 (Sworn Brother)", "Gan Fu Ren (Lady Gan) 甘夫人 (Wife)"], "faction": "Shu", "name": "Liú Bèi 刘备", "abilities": [{"description": "During your action phase, you can give any number of on-hand cards to any other player. If you give three or more on-hand cards away in a single phase, you regain 1 unit of health.", "name": "Benevolence 仁德 (rén dé)"}]},
{"key": "yuan-shao", "partners": ["Yan Liang &amp; Wen Chou 颜良&amp;文丑 (Most trusted Generals)"], "faction": "Neutral", "name": "Yuán Shào 袁绍", "abilities": [{"description": "During your action phase, you can use two on-hand cards with the same suit as RAINING ARROWS 万箭齐发.", "name": "Barrage 乱击 (luàn jī)"}]},
{"key": "zhou-yu", "partners": ["Huang Gai (\"Trojan Flesh\" ploy partner)", "Xiao Qiao (Wife)"], "faction": "Wu", "name": "Zhōu Yú 周瑜", "abilities": [{"description": "When you draw cards during your drawing phase, you can draw one additional card.", "name": "Heroic Demeanor 英姿(yīng zī)"}, {"description": "During your action phase, you can choose another player to pick a suit. This player then acquires one of your on-hand cards and reveals it to everyone. If the suit of the acquired card is different from the suit he/she had chosen, you cause 1 unit of damage to that player. Limited to once per phase.", "name": "Sow Dissension 反间 (fǎn jiàn)"}]},
{"key": "zhou-tai", "partners": ["Sun Quan (Lord)"], "faction": "Wu", "name": "Zhōu Tài 周泰", "abilities": [{"description": "Whenever your health is reduced by 1 unit while your current unit of health is 0, you can reveal a card from the top of the deck and place it onto your character card. As long as none of these cards have the same number (Ace thru King) displayed, you do not die. If a card is revealed with the same point as another existing card, you enter the Brink of Death.", "name": "Refuting Death 不屈 (bù qū)"}]},
{"key": "zhang-zhao-zhang-hong", "partners": ["Nil."], "faction": "Wu", "name": "Zhāng Zhāo & Zhāng Hóng 张昭&张纮", "abilities": [{"description": "During your action phase, you can place an on-hand equipment card into the equipped item area of another player, and then you draw a card.", "name": "Blunt advice 直谏 (zhí jiàn)"}, {"description": "At the end of other players’ discard phase, you can return a card that was discarded in this phase from the discard pile to that player. If you do so, you can acquire all other cards discarded in this player's discard phase from the discard pile.", "name": "Stabilization 固政 (gù zhèng)"}]},
{"key": "xiao-qiao", "partners": ["Zhou Yu (Husband)", "Da Qiao (Sister)"], "faction": "Wu", "name": "Xiǎo Qiáo 小乔", "abilities": [{"description": "Every instance you receive damage, you can discard an on-hand card with suit of hearts to transfer the damage to another player, then that player draws X cards (X being the units of health that player has lost thus far).", "name": "Heavenly Scent 天香 (tiān xiāng)"}, {"description": "Your cards with the suit of spades are viewed as cards with the suit of hearts.", "name": "Rosy Cheeks 红颜 (hóng yán) [Enforced ability]"}]},
{"key": "sun-shangxiang", "partners": ["Nil."], "faction": "Wu", "name": "Sūn Shàngxiāng 孙尚香", "abilities": [{"description": "During your action phase, you can discard two on-hand cards and choose another player (with combined characters as a male) that is not at full-health. That player and you regain 1 unit of health each. Limited to once per phase.", "name": "Marriage 结姻 (jié yīn)"}, {"description": "Every instance you lose equipment cards in your equipped item area, you can draw two cards.", "name": "Warrior Lady 枭姬 (xiāo jī)"}]},
{"key": "zou-shi-lady-zou", "partners": ["Nil."], "faction": "Neutral", "name": "Zōu Shì (Lady Zou) 邹氏", "abilities": [{"description": "During the action phase, you can expose this character card. Within your turns, if this character card is exposed, other players cannot expose their character cards.", "name": "Femme Fatale 祸水 (huò shuǐ)"}, {"description": "During the action phase, you can discard an equipment card and select another player that has both character cards already exposed. You then choose one of that player's character cards and \"hide\" it (flip it over such that it is in the hidden state).", "name": "Impetus for Conflicts 倾城 (qīng chéng)"}]},
{"key": "yan-liang-wen-chou", "partners": ["Yuan Shao 袁绍 (Lord)"], "faction": "Neutral", "name": "Yán Liáng & Wén Chǒu 颜良文丑", "abilities": [{"description": "During your draw phase, you can forfeit drawing cards from the deck and make a judgement instead. You acquire this judgement card, and you can use an on-hand card with the different colour of the judgement card as DUEL决斗 in this turn.", "name": "Dual Heroes 双雄 (shuāng xióng)"}]},
{"key": "tian-feng", "partners": ["Nil."], "faction": "Neutral", "name": "Tián Fēng 田丰", "abilities": [{"description": "When you lose your last on-hand card, you can discard 1 card from another player.", "name": "Deathly Counsel 死谏 (sǐ jiàn)"}, {"description": "When another player goes into brink of death, if the source of damage that caused it is from the same Kingdom as you are, draw 1 card from the deck. When a player from the same Kingdom as you dies, you lose 1 unit of health.", "name": "With the Tide 随势 (suí shì) [Enforced ability]"}]},
{"key": "pang-de", "partners": ["Nil."], "faction": "Neutral", "name": "Páng Dé 庞德", "abilities": [{"description": "Your distance calculated to other players is reduced by 1.", "name": "Horsemanship 马术 (mǎ shù) [Enforced ability]"}, {"description": "Whenever your ATTACK 杀 is neutralized by a DODGE 闪 from the target player, you can discard a card from the target player.", "name": "Fearsome Advance 猛进 (měng jìn)"}]},
{"key": "pan-feng", "partners": ["Nil"], "faction": "Neutral", "name": "Pān Fèng 潘凤", "abilities": [{"description": "Every instance after your ATTACK 杀 inflicts damage to your victim, you can select a card in the equipped item area of your victim and relocate it to your equipped item area, or discard it.", "name": "Insanity Axe 狂斧 (kuáng fǔ)"}]},
{"key": "ma-teng", "partners": ["Nil."], "faction": "Neutral", "name": "Mǎ Téng 马腾", "abilities": [{"description": "Your physical distance to other players is reduced by 1.", "name": "Horsemanship 马术 (mǎ shù) [Enforced ability]"}, {"description": "During your action phase, you can let every players of the same Kingdom as you draw three cards each. If your Kingdom has the least (or amongst the least) number of players among all the Kingdoms in play, you regain 1 unit of health.", "name": "Call of Valour 雄异 (xióng yì) [Single-use ability]"}]},
{"key": "kong-rong", "partners": [], "faction": "Neutral", "name": "Kǒng Róng 孔融", "abilities": [{"description": "Whenever you receive damage, if the source of damage has hidden character cards, the damage is reduced by -1.", "name": "Celebrity 名士 (míng shì)"}, {"description": "When your cards are discarded into the discard pile, you can give those cards to another player.", "name": "Comity 礼让 (lǐ ràng)"}]},
{"key": "ji-ling", "partners": ["Nil"], "faction": "Neutral", "name": "Jì Líng 纪灵", "abilities": [{"description": "At the beginning of your action phase, you can conduct Points Duel with another player. If you win, it is viewed as you using an ATTACK 杀 on that player or on another player from the victim's Kingdom (this ATTACK will not be considered in calculating the number of ATTACK cards used in your action phase). If you do not win, you action phase is ended.", "name": "Double Edged 双刃 (shuāng rèn)"}]},
{"key": "jia-xu", "partners": ["Nil."], "faction": "Neutral", "name": "Jiǎ Xǔ 贾诩", "abilities": [{"description": "Within your turn, only yourself and players at Brink of Death can use PEACH 桃.", "name": "Unmitigated Murder 完杀 (wán shā) [Enforced ability]"}, {"description": "During your action phase, you can force all other players to choose between 1 of 2 options:\n1. Use an ATTACK杀 on a player with the least distance from him/her\n2. Lose 1 unit of health.", "name": "Descend into Chaos 乱武 (luàn wǔ) [Single-Use Ability]"}, {"description": "All black-suited tool cards targeted on you will be cancelled.", "name": "Behind the Curtain 帷幕 (wéi mù) [Enforced ability]"}]},
{"key": "hua-tuo", "partners": ["Nil."], "faction": "Neutral", "name": "Huà Tuó 华佗", "abilities": [{"description": "Outside of your turn, you can use a red-suited card as PEACH 桃.", "name": "First Aid 急救 (jí jiù)"}, {"description": "During your action phase, you can discard an on-hand card to cause a player to regain 1 unit of health. Limited to once per phase.", "name": "Green Salve 青囊 (qīng náng)"}]},
{"key": "cai-wen-ji-lady-cai", "partners": ["Nil."], "faction": "Neutral", "name": "Cài Wén Jī (Lady Cai)  蔡文姬", "abilities": [{"description": "Every instance after a player suffers damage from ATTACK, you can discard a card and let that player make a judgement. If the result is:\n\nHearts: the victim regains 1 unit of health.\nDiamonds: the victim draws two cards.\nClubs: the attacker discards two cards.\nSpades: the attacker stacks his/her character cards.", "name": "Dirge 悲歌 (bēi gē)"}, {"description": "When you die, you cause the player who kills you to lose all the abilities of one of his/her character cards.", "name": "Sorrow 断肠 (duan chang) [Enforced ability]"}]},
{"key": "diao-chan", "partners": ["Lu Bu (Puppet)"], "faction": "Neutral", "name": "Diāo Chán 貂蝉", "abilities": [{"description": "During your action phase, you can discard a card and select two other male characters. It is then viewed as one of the players used a DUEL 决斗 on the other player. This DUEL cannot be responded to with NEGATE 无懈可击. Limited to once per phase.", "name": "Seed of Animosity 离间 (lí jiān)"}, {"description": "At your end phase, you can draw a card.", "name": "Envious Moon 闭月 (bì yuè)"}]},
{"key": "lu-bu", "partners": ["Diao Chan (Puppet Master)"], "faction": "Neutral", "name": "Lǚ Bù 吕布", "abilities": [{"description": "After selecting a player as the target of your ATTACK 杀, the target of your ATTACK need to use two DODGE 闪 successively to neutralize your ATTACK. During a DUEL 决斗, your opponent needs to play two ATTACKS successively each time.", "name": "Without Equal 无双 (wú shuāng) [Enforced ability]"}]},
{"key": "zhang-jiao", "partners": ["Nil."], "faction": "Neutral", "name": "Zhāng Jiǎo 张角", "abilities": [{"description": "Whenever you use or play a DODGE 闪, you can select another player to make a judgement. If the result is the suit of spades, you inflict 2 units of lightning damage to that player.", "name": "Lightning Strike 雷击 (léi jī)"}, {"description": "Before the judgement card of a player takes effect, you can interchange that judgement card with a black-suited card.", "name": "Dark Sorcery 鬼道 (gǔi dào)"}]},
{"key": "taishi-ci", "partners": ["Nil."], "faction": "Wu", "name": "Tàishǐ Cí 太史慈", "abilities": [{"description": "During your action phase, you can conduct a Points Duel with another player. If you win, you acquire all of the following until the end of your turn.\n\n1.    Your ATTACKS 杀 are not limited by range,\n2. You can use one additional ATTACK,\n3. You can target one additional player when you use ATTACK.\n\nIf you lose, you cannot use ATTACK till the end of the turn. Limited to once per phase.", "name": "Justice of Heaven 天义 (tiān yì)"}]},
{"key": "sun-jian", "partners": ["Nil."], "faction": "Wu", "name": "Sūn Jiān 孙坚", "abilities": [{"description": "At your beginning phase, if you are not at full health, you can choose between 1 of 2 options: \n1. Pick another player to draw X cards, and then discard 1 card. \n2. Pick another player to draw 1 card, and then discard X cards.\n(X being the units of health you have lost thus far).", "name": "Heroic Spirit 英魂 (yīng hún)"}]},
{"key": "lu-xun", "partners": ["Nil."], "faction": "Wu", "name": "Lù Xùn 陆逊", "abilities": [{"description": "When you become the target of STEAL 顺手牵羊 or ACEDIA 乐不思蜀, these cards are nullified.", "name": "Humility 谦逊 (qiān xùn) [Enforced ability]"}, {"description": "During your action phase, you can use a red on-hand card as AMASS 以逸待勞.", "name": "Scrutinize 度勢 (duó shì)"}]},
{"key": "lu-su", "partners": ["Nil."], "faction": "Wu", "name": "Lǔ Sù 鲁肃", "abilities": [{"description": "When you draw cards during your drawing phase, you can draw two additional cards. If you have more than five on-hand cards as a result, you must give half of your on-hand cards (rounded down to nearest integer) to another player with the smallest number of on-hand cards.", "name": "Altruism 好施 (hào shī)"}, {"description": "During your action phase, you can choose 2 players (other than yourself) and discard as many cards as the difference between the number of on-hand cards between these 2 players. Then exchange their entire set of on-hand cards. Limited to one use per phase.", "name": "Alliance 缔盟 (dì méng)"}]},
{"key": "lu-meng", "partners": ["Nil."], "faction": "Wu", "name": "Lǚ Méng 吕蒙", "abilities": [{"description": "If you have not used or played ATTACK 杀 in your action phase, you can skip your discard phase for this turn.", "name": "Self-Mastery 克己 (kè jǐ)"}]},
{"key": "huang-gai", "partners": ["Zhou Yu 周瑜 (\"Trojan Flesh\" ploy partner)"], "faction": "Wu", "name": "Huáng Gài 黄盖", "abilities": [{"description": "During your action phase, you can lose 1 unit of health, and then draw two cards.", "name": "Trojan Flesh 苦肉 (kǔ ròu)"}]},
{"key": "gan-ning", "partners": ["Nil."], "faction": "Wu", "name": "Gān Níng 甘宁", "abilities": [{"description": "During your action phase, you can use a black-suited card as DISMANTLE过河拆桥.", "name": "Surprise Raid 奇袭 (qí xí)"}]},
{"key": "ding-feng", "partners": ["Nil."], "faction": "Wu", "name": "Dīng Fèng 丁奉", "abilities": [{"description": "Whenever you use an ATTACK 杀, you can pick one additional player within your physical distance of 1 as the target of the ATTACK.", "name": "Close Combat 短兵 (duǎn bīng)"}, {"description": "During your action phase, you can discard a card and select a player. The physical distance between you and that player is viewed as 1 till the end of your turn. Limited to once per phase.", "name": "Swift and Deadly 奋迅 (fèn xùn)"}]},
{"key": "da-qiao", "partners": ["Xiao Qiao (Sister)"], "faction": "Wu", "name": "Dà Qiáo 大乔", "abilities": [{"description": "During your action phase, you can use a card with the suit of diamonds as ACEDIA 乐不思蜀.", "name": "National Beauty 国色 (guó sè)"}, {"description": "When you become the target of an ATTACK, you can discard an on-hand card to transfer this ATTACK to another player within your attacking range. The receiving player cannot be the same player that used the ATTACK.", "name": "Displacement 流离 (liú lí)"}]},
{"key": "sun-quan", "partners": ["Zhou Tai 周泰 (Rescued by)"], "faction": "Wu", "name": "Sūn Quán 孙权", "abilities": [{"description": "During your action phase, you can discard up to X cards (X being your maximum health units), then draw the same number of cards. Limited to once per phase.", "name": "Balance of Power 制衡 (zhì héng)"}]},
{"key": "zhen-ji-lady-zhen", "partners": ["Cao Pi曹丕 (Husband)"], "faction": "Wei", "name": "Zhēn Jī (Lady Zhen) 甄姬", "abilities": [{"description": "You can use or play a black on-hand card as DODGE.", "name": "Stunning Beauty 倾国 (qīng guó)"}, {"description": "At your beginning of your turn, you can flip a judgement card. If the result is black-suited, you can flip another judgement card, until a red-suited judgement results. After that, you acquire all the black judgement cards.", "name": "Goddess Luo 洛神 (luò shén)"}]},
{"key": "zhang-liao", "partners": ["Nil."], "faction": "Wei", "name": "Zhāng Liáo 张辽", "abilities": [{"description": "During your drawing phase, you can forfeit drawing cards from the deck. Instead, you acquire one on-hand card each from one to two other players.", "name": "Sudden Strike 突击 (tū jī)"}]},
{"key": "zhang-he", "partners": ["Nil."], "faction": "Wei", "name": "Zhāng Hé 张郃", "abilities": [{"description": "You can discard an on-hand card to skip one of your phases (except your beginning phase and your end phase).\n\nIf you skip your drawing phase, you acquire an on-hand card from each of a maximum of two players.\n\nIf you skip your action phase, you can relocate a card from any player's equipment area/pending area to a corresponding area of another player.", "name": "Flexibility 巧变 (qiǎo biàn)"}]},
{"key": "yue-jin", "partners": ["Nil."], "faction": "Wei", "name": "Yuè Jìn 乐进 ", "abilities": [{"description": "At the ending phase of another player's turn, you can discard a basic card. If you do so, that player needs to discard an equipment card, or else you inflict 1 unit of damage to that player.", "name": "Dauntless 骁果 (xiāo guǒ)"}]},
{"key": "xun-yu", "partners": ["Nil."], "faction": "Wei", "name": "Xún Yù 荀彧", "abilities": [{"description": "During your action phase, you can conduct a Points Duel with a player with more health than you. If you win, that player inflicts 1 unit of damage to another player within his/her attack range of your choice. If you lose, that player inflicts 1 unit of damage to you.", "name": "Rouse the Tiger 驱虎 (qū hǔ)"}, {"description": "After every1 unit of damage you suffer, you can pick a player to replenish on-hand cards such that number of on-hand cards equals his/her maximum health. (Maximum replenishment of 5 cards)", "name": "Eternal Loyalty 节命 (jié mìng)"}]},
{"key": "xu-huang", "partners": ["Nil."], "faction": "Wei", "name": "Xú Huǎng 徐晃", "abilities": [{"description": "You can use a black-suited basic card or equipment card as RATIONS DEPLETED 兵粮寸断. You can use RATIONS DEPLETED on other players within the physical distance of 2.", "name": "Blockade 断粮 (duàn liáng)"}]},
{"key": "xu-chu", "partners": ["Cao Cao 曹操 (Lord)"], "faction": "Wei", "name": "Xǔ Chǔ 许褚", "abilities": [{"description": "During your drawing phase, you can draw one card less so that the damage inflicted by your ATTACK 杀 and DUEL 决斗 (when you are the source of damage) is increased by 1. This effect lasts till the end of your turn.", "name": "Bare-Chested 裸衣 (luǒ yī)"}]},
{"key": "xiahou-yuan", "partners": ["Xiahou Dun 夏侯惇 (Cousin)"], "faction": "Wei", "name": "Xiàhóu Yuān 夏侯渊", "abilities": [{"description": "You can choose one or both of the following options:\n\n1.    Skip your judgement phase and drawing phase.\n\n2.    Skip your action phase and discard an equipment card.\n\nEvery time you choose one of these options, it is viewed as you using an ATTACK 杀 on another player.", "name": "Godspeed 神速 (shén sù)"}]},
{"key": "xiahou-dun", "partners": ["Xiahou Yuan 夏侯淵 (Cousin)"], "faction": "Wei", "name": "Xiàhóu Dūn 夏侯惇", "abilities": [{"description": "Every instance after you suffer damage, you can flip a judgement card. If the judgment result is not hearts, the source of damage needs to choose between 1 of 2 options:\n\n1. Discard two on-hand cards of his/her choice\n\n2. Receive 1 unit of damage inflicted by you.", "name": "An Eye for an Eye 刚烈 (gāng liè)"}]},
{"key": "sima-yi", "partners": ["Nil."], "faction": "Wei", "name": "Sīmǎ Yì 司马懿", "abilities": [{"description": "Every instance after you suffer damage, you can acquire a card from the source of damage.", "name": "Retaliation 反馈 (fǎn kuì)"}, {"description": "Before the judgement card of a player takes effect, you can play an on-hand card to replace it.", "name": "Demonic Talent鬼才(guǐ cái)"}]},
{"key": "guo-jia", "partners": ["Nil."], "faction": "Wei", "name": "Guō Jiā 郭嘉", "abilities": [{"description": "After your judgement card takes effect, you can acquire the judgement card.", "name": "Envy of Heaven 天妒 (tiān dù)"}, {"description": "After every 1 unit of damage you suffer, you can view the top two cards of the deck, give one card to a player, then give the remaining card to a player.", "name": "Bequeathed Strategy 遗计 (yí jì)"}]},
{"key": "dian-wei", "partners": ["Cao Cao曹操 (Lord)"], "faction": "Wei", "name": "Diǎn Wěi 典韦", "abilities": [{"description": "During your action phase, you can either lose 1 unit of health or discard a weapon card to inflict 1 unit of damage to another player within your attacking range. Limited to once per phase.", "name": "Ferocious Assault 强袭 (qiáng xí)"}]},
{"key": "cao-ren", "partners": ["Nil."], "faction": "Wei", "name": "Cáo Rén 曹仁", "abilities": [{"description": "At the end phase of your turn, you can draw three cards, then you stack your character cards.", "name": "Entrenched 据守 (jù shǒu)"}]},
{"key": "cao-pi", "partners": ["Zhen Ji (Lady Zhen) 甄姬 (Wife)"], "faction": "Wei", "name": "Cáo Pī 曹丕", "abilities": [{"description": "You can acquire all the cards of players that died.", "name": "Scavenge 行殇 (xíng shāng)"}, {"description": "Every instance after you suffer damage, you can make another player draw X cards (X being the units of health you have lost thus far), then that player stacks/unstacks his/her character cards.", "name": "Banish 放逐 (fàng zhú)"}]},
{"key": "cao-cao", "partners": ["Dian Wei 典韦 (Bodyguard)", "Xu Chu 许褚 (Bodyguard)"], "faction": "Wei", "name": "Cáo Cāo 曹操", "abilities": [{"description": "Every instance after you suffer damage, you can acquire the card that inflicted damage on you.", "name": "Villainous Hero 奸雄 (jiān xióng)"}]},
{"key": "zhu-rong", "partners": ["Meng Huo 孟获 (Husband)"], "faction": "Shu", "name": "Zhù Róng 祝融", "abilities": [{"description": "BARBARIANS南蛮入侵 have no effect on you. When any BARBARIANS 南蛮入侵 used by other players is placed into the discard pile after all damage has been resolved, you acquire it.", "name": "Giant Elephant 巨象 (jù xiàng) [Enforced ability]"}, {"description": "Every instance after you inflict damage to your target by using ATTACK杀, you can conduct a Points Duel with that target player. If you win, you acquire a card from that player.", "name": "Fearsome Blade 烈刃 (liè rèn)"}]},
{"key": "zhao-yun", "partners": ["Liu Shan 刘禅 (Rescued at the Battle of Changban)"], "faction": "Shu", "name": "Zhào Yún 赵云", "abilities": [{"description": "You can use or play your ATTACK 杀 as DODGE 闪, and vice versa.", "name": "Dragon Heart 龙胆 (lóng dǎn)"}]},
{"key": "wei-yan", "partners": ["Huang Zhong 黄忠 (Colleague since serving Han Xuan 韩玄)"], "faction": "Shu", "name": "Wèi Yán 魏延", "abilities": [{"description": "After you inflict 1 unit of damage to a player within physical distance of 1, you regain 1 unit of health.", "name": "Insanity Streak 狂骨 (kuáng gǔ) [Enforced ability]"}]},
{"key": "pang-tong", "partners": ["Younger Zhuge Liang 卧龙诸葛亮 (\"Dragon-Phoenix\" Combination, Good Friend)"], "faction": "Shu", "name": "Páng Tǒng 庞统", "abilities": [{"description": "During your action phase, you can use an on-hand card with the suit of clubs as IRON SHACKLES铁索连环, or to re-draw 1 card.", "name": "Shackle 连环 (lián huán)"}, {"description": "When you are at the Brink of Death, you can discard all of your cards (on-hand and equipped) and all cards in your pending area, then reset your character card such that it is unstacked and unshackled, draw three cards, and regain your health to 3 units.", "name": "Resurrection 涅槃 (niè pán) [Single-use ability]"}]},
{"key": "meng-huo", "partners": ["Zhu Rong 祝融 (Wife)"], "faction": "Shu", "name": "Mèng Huò 孟获", "abilities": [{"description": "BARBARIANS 南蛮入侵 has no effect on you. You are the source of damage caused by BARBARIANS 南蛮入侵.", "name": "The Smoking Gun 祸首 (huò shǒu) [Enforced ability]"}, {"description": "During your drawing phase, if you are not at full health, you can forfeit drawing cards from the deck; instead, you display X cards from the top of the deck (X being the units of health you have lost thus far). For every card with hearts suit displayed, you regain 1 unit of health, then you discard those cards and acquire the remaining cards.", "name": "Arise Again 再起 (zài qǐ)"}]},
{"key": "ma-chao", "partners": ["Nil."], "faction": "Shu", "name": "Mǎ Chāo 马超", "abilities": [{"description": "Your distance and range when calculated to other players is always -1.", "name": "Horsemanship 马术 (mǎ shù) [Enforced ability]"}, {"description": "After selecting a player as the target of your ATTACK 杀, you can make a judgement. If the result is red-suited, the target cannot respond to this ATTACK with DODGE 闪.", "name": "Iron Calvary 铁骑 (tiě jì)"}]},
{"key": "liu-shan", "partners": ["Zhao Yun 赵云 (Rescued by)"], "faction": "Shu", "name": "Liú Shàn 刘禅", "abilities": [{"description": "When other player selects you as the target of ATTACK 杀, he/she needs to discard a basic card, or else that ATTACK 杀 has no effect you.", "name": "Relish 享乐 (xiǎng lè) [Enforced ability]"}, {"description": "You can skip your action phase, then discard an on-hand card at the end of your turn to give another player an extra turn.", "name": "Devolution 放权 (fàng quán)"}]},
{"key": "huang-zhong", "partners": ["Wei Yan 魏延 (Colleague since serving Han Xuan 韩玄)"], "faction": "Shu", "name": "Huáng Zhōng 黄忠", "abilities": [{"description": "After selecting a player as the target of your ATTACK 杀 in your action phase, you can disallow this ATTACK 杀 to be responded with DODGE 闪 under the following circumstances:\n\n1.    The number of on-hand cards of the target player is greater or equal to your current units of health.\n\n2.    The number of on-hand cards of the target player is smaller or equal to your attack range.", "name": "Fearsome Archer 烈弓 (liè gōng)"}]},
{"key": "gan-fu-ren-lady-gan", "partners": ["Liu Bei 刘备 (Husband)"], "faction": "Shu", "name": "Gān Fū Rén (Lady Gan) 甘夫人", "abilities": [{"description": "Whenever you regain 1 unit of health, you can let another player of your Kingdom to draw 1 card.\n\n(Note: I use \"Kingdom\" here instead of allegiance. This is because if you are an \"Ambitionist 野心家\", you are your own kingdom, even though you have other players with the same allegiance as you.)", "name": "Prudence 淑慎 (shū shèn)"}, {"description": "At the beginning of your turn, you can discard all your on-hand cards. If by doing so, the number of your discarded cards is not smaller than X, you regain 1 unit of health (X equals to your current health).", "name": "Divine Wisdom 神智 (shén zhì)"}]},
{"key": "huang-yueying", "partners": ["Elder Zhuge Liang 暮年诸葛亮 (Husband)", "Younger Zhuge Liang 卧龙诸葛亮 (Husband)"], "faction": "Shu", "name": "Huáng Yuèyīng 黄月英", "abilities": [{"description": "When you use a non-time-delay tool card that is not converted from other cards, you can draw a card.", "name": "Assembling Wisdom 集智 (jí zhì)"}, {"description": "There is no distance restriction on tool cards used by you.", "name": "Genius 奇才 (qí cái) [Enforced Ability]"}]},
{"key": "zhang-fei", "partners": ["Liu Bei 刘备 (Sworn Brother)"], "faction": "Shu", "name": "Zhāng Fēi 张飞", "abilities": [{"description": "During your action phase, you can use any number of ATTACK 杀.", "name": "Berserk 咆哮 (páo xiāo)"}]},
{"key": "guan-yu", "partners": ["Liu Bei 刘备 (Sworn Brother)"], "faction": "Shu", "name": "Guān Yǔ 关羽", "abilities": [{"description": "You can use or play a red-suited card as ATTACK 杀.", "name": "Warrior Saint 武圣 (wǔ shèng)"}]},
{"key": "younger-zhuge-liang", "partners": ["Huang Yueying 黄月英 (Wife)", "Pang Tong 庞统 (\"Dragon-Phoenix\" Combination, Good Friend)"], "faction": "Shu", "name": "Younger Zhūgě Liàng 卧龙诸葛亮", "abilities": [{"description": "If there is no armour card in your equipped item area, it is viewed as you have EIGHT TRIGRAMS 八卦阵 equipped.", "name": "Eight Trigrams 八阵 (bā zhèn) [Enforced Ability]"}, {"description": "During your action phase, you can use a red-suited on-hand card as BLAZE 火攻.", "name": "Arson 火计 (huǒ jì)"}, {"description": "You can use a black-suited on-hand card as NEGATE 无懈可击.", "name": "Scient 看破 (kàn pò)"}]},
{"key": "elder-zhuge-liang", "partners": ["Huang Yueying 黄月英 (Wife)"], "faction": "Shu", "name": "Elder Zhūgě Liàng 暮年诸葛亮", "abilities": [{"description": "At the beginning phase of your turn, you can view X cards from the top of the deck (X being the number of players still alive in the game, and cannot exceed 5). Place any number of these cards, in any order, on the top of the deck . Place the remaining cards, in any order, at the bottom of the deck .", "name": "Star Gazing 观星 (guān xīng)"}, {"description": "An ATTACK 杀 or DUEL 决斗 will be cancelled if you have become the target and you have no cards on-hand.", "name": "Empty City 空城 (kōng chéng) [Enforced Ability]"}]}
]